wp-content/plugins/a2z-fedex-shipping/controllors/xml/ship.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v21="http://fedex.com/ws/ship/v21">
   <soapenv:Header/>
   <soapenv:Body>
      <v21:ProcessShipmentRequest>
         <v21:WebAuthenticationDetail>
            <v21:UserCredential>
               <v21:Key>{key}</v21:Key>
               <v21:Password>{pwd}</v21:Password>
            </v21:UserCredential>
         </v21:WebAuthenticationDetail>
         <v21:ClientDetail>
            <v21:AccountNumber>{account_num}</v21:AccountNumber>
            <v21:MeterNumber>{meter_num}</v21:MeterNumber>
         </v21:ClientDetail>
         <v21:Version>
            <v21:ServiceId>ship</v21:ServiceId>
            <v21:Major>21</v21:Major>
            <v21:Intermediate>0</v21:Intermediate>
            <v21:Minor>0</v21:Minor>
         </v21:Version>
         <v21:RequestedShipment>
            <v21:ShipTimestamp>{shipmenttime}</v21:ShipTimestamp>
            <v21:DropoffType>{dropoff}</v21:DropoffType>
            <v21:ServiceType>{shipservice}</v21:ServiceType>
            <v21:PackagingType>{packingtype}</v21:PackagingType>
            <v21:TotalWeight>
               <v21:Units>{weightunit}</v21:Units>
               <v21:Value>{totalweight}</v21:Value>
            </v21:TotalWeight>
			<v21:Shipper>
               <v21:AccountNumber>{account_num}</v21:AccountNumber>
               <v21:Contact>
                  <v21:PersonName>{s_person_name}</v21:PersonName>
                  <v21:CompanyName>{s_company_name}</v21:CompanyName>
                  <v21:PhoneNumber>{s_mobile_number}</v21:PhoneNumber>
                  <v21:EMailAddress>{s_email_address}</v21:EMailAddress>
               </v21:Contact>
               <v21:Address>
                  <v21:StreetLines>{s_streetlines}</v21:StreetLines>
                  <v21:City>{s_city}</v21:City>
                  <v21:StateOrProvinceCode>{s_state_code}</v21:StateOrProvinceCode>
                  <v21:PostalCode>{s_postal}</v21:PostalCode>
                  <v21:CountryCode>{s_county}</v21:CountryCode>
                </v21:Address>
            </v21:Shipper>
            <v21:Recipient>
               <v21:Contact>
                  <v21:PersonName>{r_person}</v21:PersonName>
                  <v21:CompanyName>{r_company_name}</v21:CompanyName>
                  <v21:PhoneNumber>{r_mobile}</v21:PhoneNumber>
				  <v21:EMailAddress>{r_email}</v21:EMailAddress>
               </v21:Contact>
               <v21:Address>
                  <v21:StreetLines>{r_street}</v21:StreetLines>
                  {r_street2}
                  <v21:City>{r_city}</v21:City>
                  <v21:StateOrProvinceCode>{r_state_code}</v21:StateOrProvinceCode>
                  <v21:PostalCode>{r_postal}</v21:PostalCode>
                  <v21:CountryCode>{r_country}</v21:CountryCode>
                  <v21:Residential>{r_res}</v21:Residential>
               </v21:Address>
            </v21:Recipient>
			<v21:ShippingChargesPayment>
               <v21:PaymentType>SENDER</v21:PaymentType>
               <v21:Payor>
                  <v21:ResponsibleParty>
                     <v21:AccountNumber>{account_num}</v21:AccountNumber>
                  </v21:ResponsibleParty>
               </v21:Payor>
            </v21:ShippingChargesPayment>
        	<v21:LabelSpecification>
				<v21:LabelFormatType>{label_format}</v21:LabelFormatType>
               <v21:ImageType>{image_type}</v21:ImageType>
               <v21:LabelStockType>{label_stock_type}</v21:LabelStockType>
            </v21:LabelSpecification>
			<v21:ShippingDocumentSpecification>
			 <v21:ShippingDocumentTypes>COMMERCIAL_INVOICE</v21:ShippingDocumentTypes>
				 <v21:CommercialInvoiceDetail>
					 <v21:Format>
						<v21:ImageType>PDF</v21:ImageType>
						<v21:StockType>PAPER_LETTER</v21:StockType>
						<v21:ProvideInstructions>1</v21:ProvideInstructions>
					 </v21:Format>
				 </v21:CommercialInvoiceDetail>
			 </v21:ShippingDocumentSpecification>
            <v21:RateRequestTypes>{rate_type}</v21:RateRequestTypes>
			{master_tracking}
            <v21:PackageCount>{package_count}</v21:PackageCount>
			{line_items}
        </v21:RequestedShipment>
      </v21:ProcessShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>